### Working with External Files. Also Group and Aggregate Dats

In [2]:
import numpy as np
import pandas as pd

In [6]:
# we may load external files from Excel, csv, json etc.
df = pd.read_csv('data/salaries.csv') # also Excel, json, xml etc.
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [30]:
df.columns
df.size # total number of data points
df.sum()
df.max() # or min(), count() etc.
df['phd']
df.sex
# df['rank'] # careful - rank is a keyword

0       Male
1       Male
2       Male
3       Male
4       Male
       ...
73    Female
74    Female
75    Female
76    Female
77    Female
Name: sex, Length: 78, dtype: object

In [38]:
# Grouping Data
df_rank = df.groupby(['rank'])
df_rank # we have a group object
df_rank.count()

           discipline  phd  service  sex  salary
rank
AssocProf          13   13       13   13      13
AsstProf           19   19       19   19      19
Prof               46   46       46   46      46

In [ ]:
df_n = df.groupby(['salary','sex']) # careful - the data may be extensive
df_n.max()

In [60]:
# find the mean salary and service for each rank
l = ['salary', 'service']
gb = df.groupby('rank')
gb[l].mean()

                  salary    service
rank
AssocProf   91786.230769  11.307692
AsstProf    81362.789474   2.210526
Prof       123624.804348  21.413043

In [76]:
# mini-challenge
# show the mean salary for each rank by male/female
a = df.groupby(['rank', 'sex'])
a[['salary']].mean() # careful [[]]
# find mean salary where salary exceeds 120000
b = df[ df['salary']>120000 ]
b.groupby(['rank'])
b[['salary']].mean()

salary    141722.4
dtype: float64

#### Aggregate Data